### Terraform Plan — `dev`

**⚠️ Changes detected**

<details><summary>Plan output</summary>

```
... (truncated — see full output in Actions log)

        async deleteWebhookEndpoint(
                                request: WebhooksDeleteWebhookEndpointRequest,
                                options?: RequestOptions,
                              ): Promise<void> {
                                return unwrapAsync(webhooksDeleteWebhookEndpoint(
                                  this,
                                  request,
                                  options,
                                ));
                              }
                            
                              /**
                               * Update Webhook Endpoint
                               *
                               * @remarks
                               * Update a webhook endpoint.
                               *
                               * **Scopes**: `webhooks:write`
                               */
                              async updateWebhookEndpoint(
                                request: WebhooksUpdateWebhookEndpointRequest,
                                options?: RequestOptions,
                              ): Promise<WebhookEndpoint> {
                                return unwrapAsync(webhooksUpdateWebhookEndpoint(
                                  this,
                                  request,
                                  options,
                                ));
                              }
                            
                              /**
                               * Reset Webhook Endpoint Secret
                               *
                               * @remarks
                               * Regenerate a webhook endpoint secret.
                               *
                               * **Scopes**: `webhooks:write`
                               */
                              async resetWebhookEndpointSecret(
                                request: WebhooksResetWebhookEndpointSecretRequest,
                                options?: RequestOptions,
                              ): Promise<WebhookEndpoint> {
                                return unwrapAsync(webhooksResetWebhookEndpointSecret(
                                  this,
                                  request,
                                  options,
                                ));
                              }
                            
                              /**
                               * List Webhook Deliveries
                               *
                               * @remarks
                               * List webhook deliveries.
                               *
                               * Deliveries are all the attempts to deliver a webhook event to an endpoint.
                               *
                               * **Scopes**: `webhooks:read` `webhooks:write`
                               */
                              async listWebhookDeliveries(
                                request: WebhooksListWebhookDeliveriesRequest,
                                options?: RequestOptions,
                              ): Promise<
                                PageIterator<WebhooksListWebhookDeliveriesResponse, { page: number }>
                              > {
                                return unwrapResultIterator(webhooksListWebhookDeliveries(
                                  this,
                                  request,
                                  options,
                                ));
                              }
                            
                              /**
                               * Redeliver Webhook Event
                               *
                               * @remarks
                               * Schedule the re-delivery of a webhook event.
                               *
                               * **Scopes**: `webhooks:write`
                               */
                              async redeliverWebhookEvent(
                                request: WebhooksRedeliverWebhookEventRequest,
                                options?: RequestOptions,
                              ): Promise<any> {
                                return unwrapAsync(webhooksRedeliverWebhookEvent(
                                  this,
                                  request,
                                  options,
                                ));
                              }
                            }
                        EOT,
                      + <<-EOT
                            /*
                             * Code generated by Speakeasy (https://speakeasy.com). DO NOT EDIT.
                             */
                            
                            import { validateWebhook } from "../funcs/validateWebhook.js";
                            import { ClientSDK } from "../lib/sdks.js";
                            import { WebhookBenefitCreatedPayload } from "../models/components/webhookbenefitcreatedpayload.js";
                            import { WebhookBenefitGrantCreatedPayload } from "../models/components/webhookbenefitgrantcreatedpayload.js";
                            import { WebhookBenefitGrantCycledPayload } from "../models/components/webhookbenefitgrantcycledpayload.js";
                            import { WebhookBenefitGrantRevokedPayload } from "../models/components/webhookbenefitgrantrevokedpayload.js";
                            import { WebhookBenefitGrantUpdatedPayload } from "../models/components/webhookbenefitgrantupdatedpayload.js";
                            import { WebhookBenefitUpdatedPayload } from "../models/components/webhookbenefitupdatedpayload.js";
                            import { WebhookCheckoutCreatedPayload } from "../models/components/webhookcheckoutcreatedpayload.js";
                            import { WebhookCheckoutExpiredPayload } from "../models/components/webhookcheckoutexpiredpayload.js";
                            import { WebhookCheckoutUpdatedPayload } from "../models/components/webhookcheckoutupdatedpayload.js";
                            import { WebhookCustomerCreatedPayload } from "../models/components/webhookcustomercreatedpayload.js";
                            import { WebhookCustomerDeletedPayload } from "../models/components/webhookcustomerdeletedpayload.js";
                            import { WebhookCustomerSeatAssignedPayload } from "../models/components/webhookcustomerseatassignedpayload.js";
                            import { WebhookCustomerSeatClaimedPayload } from "../models/components/webhookcustomerseatclaimedpayload.js";
                            import { WebhookCustomerSeatRevokedPayload } from "../models/components/webhookcustomerseatrevokedpayload.js";
                            import { WebhookCustomerStateChangedPayload } from "../models/components/webhookcustomerstatechangedpayload.js";
                            import { WebhookCustomerUpdatedPayload } from "../models/components/webhookcustomerupdatedpayload.js";
                            import { WebhookMemberCreatedPayload } from "../models/components/webhookmembercreatedpayload.js";
                            import { WebhookMemberDeletedPayload } from "../models/components/webhookmemberdeletedpayload.js";
                            import { WebhookMemberUpdatedPayload } from "../models/components/webhookmemberupdatedpayload.js";
                            import { WebhookOrderCreatedPayload } from "../models/components/webhookordercreatedpayload.js";
                            import { WebhookOrderPaidPayload } from "../models/components/webhookorderpaidpayload.js";
                            import { WebhookOrderRefundedPayload } from "../models/components/webhookorderrefundedpayload.js";
                            import { WebhookOrderUpdatedPayload } from "../models/components/webhookorderupdatedpayload.js";
                            import { WebhookOrganizationUpdatedPayload } from "../models/components/webhookorganizationupdatedpayload.js";
                            import { WebhookProductCreatedPayload } from "../models/components/webhookproductcreatedpayload.js";
                            import { WebhookProductUpdatedPayload } from "../models/components/webhookproductupdatedpayload.js";
                            import { WebhookRefundCreatedPayload } from "../models/components/webhookrefundcreatedpayload.js";
                            import { WebhookRefundUpdatedPayload } from "../models/components/webhookrefundupdatedpayload.js";
                            import { WebhookSubscriptionActivePayload } from "../models/components/webhooksubscriptionactivepayload.js";
                            import { WebhookSubscriptionCanceledPayload } from "../models/components/webhooksubscriptioncanceledpayload.js";
                            import { WebhookSubscriptionCreatedPayload } from "../models/components/webhooksubscriptioncreatedpayload.js";
                            import { WebhookSubscriptionPastDuePayload } from "../models/components/webhooksubscriptionpastduepayload.js";
                            import { WebhookSubscriptionRevokedPayload } from "../models/components/webhooksubscriptionrevokedpayload.js";
                            import { WebhookSubscriptionUncanceledPayload } from "../models/components/webhooksubscriptionuncanceledpayload.js";
                            import { WebhookSubscriptionUpdatedPayload } from "../models/components/webhooksubscriptionupdatedpayload.js";
                            import { unwrapAsync } from "../types/fp.js";
                            import { BenefitGrants } from "./benefitgrants.js";
                            import { Benefits } from "./benefits.js";
                            import { CheckoutLinks } from "./checkoutlinks.js";
                            import { Checkouts } from "./checkouts.js";
                            import { CustomerMeters } from "./customermeters.js";
                            import { CustomerPortal } from "./customerportal.js";
                            import { Customers } from "./customers.js";
                            import { CustomerSeats } from "./customerseats.js";
                            import { CustomerSessions } from "./customersessions.js";
                            import { CustomFields } from "./customfields.js";
                            import { Discounts } from "./discounts.js";
                            import { Disputes } from "./disputes.js";
                            import { Events } from "./events.js";
                            import { EventTypes } from "./eventtypes.js";
                            import { Files } from "./files.js";
                            import { LicenseKeys } from "./licensekeys.js";
                            import { Members } from "./members.js";
                            import { MemberSessions } from "./membersessions.js";
                            import { Meters } from "./meters.js";
                            import { Metrics } from "./metrics.js";
                            import { Oauth2 } from "./oauth2.js";
                            import { Orders } from "./orders.js";
                            import { OrganizationAccessTokens } from "./organizationaccesstokens.js";
                            import { Organizations } from "./organizations.js";
                            import { Payments } from "./payments.js";
                            import { Products } from "./products.js";
                            import { Refunds } from "./refunds.js";
                            import { Subscriptions } from "./subscriptions.js";
                            import { Webhooks } from "./webhooks.js";
                            
                            export class Polar extends ClientSDK {
                              private _organizations?: Organizations;
                              get organizations(): Organizations {
                                return (this._organizations ??= new Organizations(this._options));
                              }
                            
                              private _subscriptions?: Subscriptions;
                              get subscriptions(): Subscriptions {
                                return (this._subscriptions ??= new Subscriptions(this._options));
                              }
                            
                              private _oauth2?: Oauth2;
                              get oauth2(): Oauth2 {
                                return (this._oauth2 ??= new Oauth2(this._options));
                              }
                            
                              private _benefits?: Benefits;
                              get benefits(): Benefits {
                                return (this._benefits ??= new Benefits(this._options));
                              }
                            
                              private _benefitGrants?: BenefitGrants;
                              get benefitGrants(): BenefitGrants {
                                return (this._benefitGrants ??= new BenefitGrants(this._options));
                              }
                            
                              private _webhooks?: Webhooks;
                              get webhooks(): Webhooks {
                                return (this._webhooks ??= new Webhooks(this._options));
                              }
                            
                              private _products?: Products;
                              get products(): Products {
                                return (this._products ??= new Products(this._options));
                              }
                            
                              private _orders?: Orders;
                              get orders(): Orders {
                                return (this._orders ??= new Orders(this._options));
                              }
                            
                              private _refunds?: Refunds;
                              get refunds(): Refunds {
                                return (this._refunds ??= new Refunds(this._options));
                              }
                            
                              private _disputes?: Disputes;
                              get disputes(): Disputes {
                                return (this._disputes ??= new Disputes(this._options));
                              }
                            
                              private _checkouts?: Checkouts;
                              get checkouts(): Checkouts {
                                return (this._checkouts ??= new Checkouts(this._options));
                              }
                            
                              private _files?: Files;
                              get files(): Files {
                                return (this._files ??= new Files(this._options));
                              }
                            
                              private _metrics?: Metrics;
                              get metrics(): Metrics {
                                return (this._metrics ??= new Metrics(this._options));
                              }
                            
                              private _licenseKeys?: LicenseKeys;
                              get licenseKeys(): LicenseKeys {
                                return (this._licenseKeys ??= new LicenseKeys(this._options));
                              }
                            
                              private _checkoutLinks?: CheckoutLinks;
                              get checkoutLinks(): CheckoutLinks {
                                return (this._checkoutLinks ??= new CheckoutLinks(this._options));
                              }
                            
                              private _customFields?: CustomFields;
                              get customFields(): CustomFields {
                                return (this._customFields ??= new CustomFields(this._options));
                              }
                            
                              private _discounts?: Discounts;
                              get discounts(): Discounts {
                                return (this._discounts ??= new Discounts(this._options));
                              }
                            
                              private _customers?: Customers;
                              get customers(): Customers {
                                return (this._customers ??= new Customers(this._options));
                              }
                            
                              private _members?: Members;
                              get members(): Members {
                                return (this._members ??= new Members(this._options));
                              }
                            
                              private _customerPortal?: CustomerPortal;
                              get customerPortal(): CustomerPortal {
                                return (this._customerPortal ??= new CustomerPortal(this._options));
                              }
                            
                              private _customerSeats?: CustomerSeats;
                              get customerSeats(): CustomerSeats {
                                return (this._customerSeats ??= new CustomerSeats(this._options));
                              }
                            
                              private _customerSessions?: CustomerSessions;
                              get customerSessions(): CustomerSessions {
                                return (this._customerSessions ??= new CustomerSessions(this._options));
                              }
                            
                              private _memberSessions?: MemberSessions;
                              get memberSessions(): MemberSessions {
                                return (this._memberSessions ??= new MemberSessions(this._options));
                              }
                            
                              private _events?: Events;
                              get events(): Events {
                                return (this._events ??= new Events(this._options));
                              }
                            
                              private _eventTypes?: EventTypes;
                              get eventTypes(): EventTypes {
                                return (this._eventTypes ??= new EventTypes(this._options));
                              }
                            
                              private _meters?: Meters;
                              get meters(): Meters {
                                return (this._meters ??= new Meters(this._options));
                              }
                            
                              private _organizationAccessTokens?: OrganizationAccessTokens;
                              get organizationAccessTokens(): OrganizationAccessTokens {
                                return (this._organizationAccessTokens ??= new OrganizationAccessTokens(
                                  this._options,
                                ));
                              }
                            
                              private _customerMeters?: CustomerMeters;
                              get customerMeters(): CustomerMeters {
                                return (this._customerMeters ??= new CustomerMeters(this._options));
                              }
                            
                              private _payments?: Payments;
                              get payments(): Payments {
                                return (this._payments ??= new Payments(this._options));
                              }
                            
                              async validateWebhook({
                                request,
                              }: {
                                request: {
                                  body: string;
                                  headers: Record<string, string> | Headers;
                                  url: string;
                                  method: string;
                                } | Request;
                              }): Promise<
                                | WebhookCheckoutCreatedPayload
                                | WebhookCheckoutUpdatedPayload
                                | WebhookCheckoutExpiredPayload
                                | WebhookCustomerCreatedPayload
                                | WebhookCustomerUpdatedPayload
                                | WebhookCustomerDeletedPayload
                                | WebhookCustomerStateChangedPayload
                                | WebhookCustomerSeatAssignedPayload
                                | WebhookCustomerSeatClaimedPayload
                                | WebhookCustomerSeatRevokedPayload
                                | WebhookMemberCreatedPayload
                                | WebhookMemberUpdatedPayload
                                | WebhookMemberDeletedPayload
                                | WebhookOrderCreatedPayload
                                | WebhookOrderUpdatedPayload
                                | WebhookOrderPaidPayload
                                | WebhookOrderRefundedPayload
                                | WebhookSubscriptionCreatedPayload
                                | WebhookSubscriptionUpdatedPayload
                                | WebhookSubscriptionActivePayload
                                | WebhookSubscriptionCanceledPayload
                                | WebhookSubscriptionUncanceledPayload
                                | WebhookSubscriptionRevokedPayload
                                | WebhookSubscriptionPastDuePayload
                                | WebhookRefundCreatedPayload
                                | WebhookRefundUpdatedPayload
                                | WebhookProductCreatedPayload
                                | WebhookProductUpdatedPayload
                                | WebhookOrganizationUpdatedPayload
                                | WebhookBenefitCreatedPayload
                                | WebhookBenefitUpdatedPayload
                                | WebhookBenefitGrantCreatedPayload
                                | WebhookBenefitGrantUpdatedPayload
                                | WebhookBenefitGrantCycledPayload
                                | WebhookBenefitGrantRevokedPayload
                              > {
                                return unwrapAsync(validateWebhook(
                                  this,
                                  { request },
                                ));
                              }
                            }
                        EOT,
                      + <<-EOT
                            /**
                             * POST /api/checkout — Polar Checkout Session 作成
                             * POST /api/customer-portal — Polar Customer Portal URL 取得
                             *
                             * 認証済みユーザーのみ利用可能 (authRequired)
                             *
                             * @see https://polar.sh/docs/features/checkout/session
                             */
                            import { Hono } from "hono";
                            import { Polar } from "@polar-sh/sdk";
                            import { authRequired } from "../middleware/auth";
                            import type { AppEnv } from "../types";
                            import { getPolarSecrets } from "../lib/secrets";
                            import { getEnvConfig } from "../env";
                            
                            const app = new Hono<AppEnv>();
                            
                            /**
                             * POST /api/checkout
                             * Body: { productId: string }
                             * Returns: { url: string }
                             */
                            app.post("/checkout", authRequired, async (c) => {
                              const userId = c.get("userId");
                              const { productId } = await c.req.json<{ productId: string }>();
                            
                              if (!productId) {
                                return c.json({ error: "productId is required" }, 400);
                              }
                            
                              const env = getEnvConfig();
                              const secrets = await getPolarSecrets(env.POLAR_SECRET_ARN);
                            
                              const polar = new Polar({
                                accessToken: secrets.POLAR_ACCESS_TOKEN,
                                server: env.ENVIRONMENT === "prod" ? "production" : "sandbox",
                              });
                            
                              const successUrl =
                                env.CORS_ORIGIN !== "*" ? `${env.CORS_ORIGIN}/pricing?checkout=success` : undefined;
                            
                              const checkout = await polar.checkouts.create({
                                products: [productId],
                                externalCustomerId: userId,
                                ...(successUrl ? { successUrl } : {}),
                              });
                            
                              return c.json({ url: checkout.url });
                            });
                            
                            /**
                             * POST /api/customer-portal
                             * Returns: { url: string }
                             */
                            app.post("/customer-portal", authRequired, async (c) => {
                              const userId = c.get("userId");
                            
                              const env = getEnvConfig();
                              const secrets = await getPolarSecrets(env.POLAR_SECRET_ARN);
                            
                              const polar = new Polar({
                                accessToken: secrets.POLAR_ACCESS_TOKEN,
                                server: env.ENVIRONMENT === "prod" ? "production" : "sandbox",
                              });
                            
                              // externalCustomerId で直接 Customer Session を作成
                              const portal = await polar.customerSessions.create({
                                externalCustomerId: userId,
                              });
                            
                              return c.json({ url: portal.customerPortalUrl });
                            });
                            
                            export default app;
                        EOT,
                      + <<-EOT
                            /**
                             * Hono アプリケーションファクトリ
                             *
                             * 全ルートとミドルウェアを統合した Hono アプリケーションを構築する。
                             * テスト用に export しており、index.ts で Lambda ハンドラーにラップされる。
                             */
                            import { Hono } from "hono";
                            import { cors } from "hono/cors";
                            import { errorHandler } from "./middleware/errorHandler";
                            import { dbMiddleware } from "./middleware/db";
                            import { getEnvConfig } from "./env";
                            import type { AppEnv } from "./types";
                            
                            // ── Route imports ───────────────────────────────────────────────────────────
                            import healthRoutes from "./routes/health";
                            import userRoutes from "./routes/users";
                            import pageRoutes from "./routes/pages";
                            import syncPageRoutes from "./routes/syncPages";
                            import noteRoutes from "./routes/notes";
                            import searchRoutes from "./routes/search";
                            import mediaRoutes from "./routes/media";
                            import clipRoutes from "./routes/clip";
                            import aiChatRoutes from "./routes/ai/chat";
                            import aiModelsRoutes from "./routes/ai/models";
                            import aiUsageRoutes from "./routes/ai/usage";
                            import aiSubscriptionRoutes from "./routes/ai/subscription";
                            import thumbSearchRoutes from "./routes/thumbnail/imageSearch";
                            import thumbGenerateRoutes from "./routes/thumbnail/imageGenerate";
                            import thumbCommitRoutes from "./routes/thumbnail/commit";
                            import webhookPolarRoutes from "./routes/webhooks/polar";
                            import checkoutRoutes from "./routes/checkout";
                            
                            export function createApp(): Hono<AppEnv> {
                              const app = new Hono<AppEnv>();
                            
                              // ── Global middleware ───────────────────────────────────────────────────
                              // CORS
                              app.use(
                                "*",
                                cors({
                                  origin: (origin) => {
                                    const env = getEnvConfig();
                                    if (env.CORS_ORIGIN === "*") return origin;
                                    const allowed = env.CORS_ORIGIN.split(",").map((s) => s.trim());
                                    return allowed.includes(origin) ? origin : allowed[0] || "*";
                                  },
                                  allowMethods: ["GET", "POST", "PUT", "DELETE", "PATCH", "OPTIONS"],
                                  allowHeaders: ["Content-Type", "Authorization"],
                                  maxAge: 86400,
                                }),
                              );
                            
                              // DB ミドルウェア (全ルートで DB クライアントを利用可能にする)
                              app.use("*", dbMiddleware);
                            
                              // エラーハンドラー
                              app.onError(errorHandler);
                            
                              // ── Routes ──────────────────────────────────────────────────────────────
                              // Health check (no auth)
                              app.route("/api", healthRoutes);
                            
                              // Webhook (no JWT auth — uses Standard Webhooks signature)
                              app.route("/api/webhooks/polar", webhookPolarRoutes);
                            
                              // Checkout & Customer Portal (auth required)
                              app.route("/api", checkoutRoutes);
                            
                              // Users
                              app.route("/api/users", userRoutes);
                            
                              // Pages
                              app.route("/api/pages", pageRoutes);
                            
                              // Sync
                              app.route("/api/sync/pages", syncPageRoutes);
                            
                              // Notes
                              app.route("/api/notes", noteRoutes);
                            
                              // Search
                              app.route("/api/search", searchRoutes);
                            
                              // Media
                              app.route("/api/media", mediaRoutes);
                            
                              // Clip
                              app.route("/api/clip", clipRoutes);
                            
                              // AI
                              app.route("/api/ai/chat", aiChatRoutes);
                              app.route("/api/ai/models", aiModelsRoutes);
                              app.route("/api/ai/usage", aiUsageRoutes);
                              app.route("/api/ai/subscription", aiSubscriptionRoutes);
                            
                              // Thumbnail
                              app.route("/api/thumbnail/image-search", thumbSearchRoutes);
                              app.route("/api/thumbnail/image-generate", thumbGenerateRoutes);
                              app.route("/api/thumbnail/commit", thumbCommitRoutes);
                            
                              // ── 404 fallback ────────────────────────────────────────────────────────
                              app.all("*", (c) => c.json({ error: "Not found" }, 404));
                            
                              return app;
                            }
                        EOT,
                      + <<-EOT
                            /**
                             * Lambda エントリポイント — Hono + AWS Lambda アダプター
                             *
                             * API Gateway HTTP API v2 イベントを Hono アプリケーションに委譲する。
                             */
                            import { handle } from "hono/aws-lambda";
                            import { createApp } from "./app";
                            
                            const app = createApp();
                            
                            export const handler = handle(app);
                        EOT,
                    ]
                  + version        = 3
                }
            )
          + filename = "index.mjs.map"
        }
    }

  # module.api.aws_apigatewayv2_route.webhook_lemonsqueezy will be destroyed
  # (because aws_apigatewayv2_route.webhook_lemonsqueezy is not in configuration)
  - resource "aws_apigatewayv2_route" "webhook_lemonsqueezy" {
      - api_id                              = "wxo058bso5" -> null
      - api_key_required                    = false -> null
      - authorization_scopes                = [] -> null
      - authorization_type                  = "NONE" -> null
      - id                                  = "9tyi8b0" -> null
      - request_models                      = {} -> null
      - route_key                           = "POST /api/webhooks/lemonsqueezy" -> null
      - target                              = "integrations/6cc5lf3" -> null
        # (4 unchanged attributes hidden)
    }

  # module.api.aws_apigatewayv2_route.webhook_polar will be created
  + resource "aws_apigatewayv2_route" "webhook_polar" {
      + api_id             = "wxo058bso5"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /api/webhooks/polar"
      + target             = "integrations/6cc5lf3"
    }

  # module.api.aws_iam_role_policy.lambda_db will be updated in-place
  ~ resource "aws_iam_role_policy" "lambda_db" {
        id          = "zedi-dev-api-lambda:zedi-dev-api-lambda-db"
        name        = "zedi-dev-api-lambda-db"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "rds-data:ExecuteStatement",
                          - "rds-data:BatchExecuteStatement",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:rds:ap-northeast-1:590183877893:cluster:zedi-dev-cluster",
                        ]
                    },
                  - {
                      - Action   = [
                          - "secretsmanager:GetSecretValue",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ap-northeast-1:590183877893:secret:zedi-dev-db-credentials-QbCDfb",
                          - "arn:aws:secretsmanager:ap-northeast-1:590183877893:secret:zedi-dev-ai-provider-keys-dSNmOv",
                          - "arn:aws:secretsmanager:ap-northeast-1:590183877893:secret:zedi-dev-thumbnail-keys-1cveVR",
                          - "arn:aws:secretsmanager:ap-northeast-1:590183877893:secret:zedi-dev-lemonsqueezy-LKeTVU",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-northeast-1:590183877893:table/zedi-dev-ai-rate-limit",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::zedi-dev-thumbnails-590183877893/*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "execute-api:ManageConnections",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:execute-api:ap-northeast-1:590183877893:1hcerlbud7/*/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.api.aws_lambda_function.main will be updated in-place
  ~ resource "aws_lambda_function" "main" {
        id                             = "zedi-dev-api"
      ~ last_modified                  = "2026-02-22T23:30:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "bFoULnz5eTB3J4+ac4ZKGngF3ZjOo9jgYsuiX3SsA4Y=" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "Project"     = "zedi"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "AI_SECRETS_ARN"           = "arn:aws:secretsmanager:ap-northeast-1:590183877893:secret:zedi-dev-ai-provider-keys-dSNmOv"
              - "AURORA_CLUSTER_ARN"       = "arn:aws:rds:ap-northeast-1:590183877893:cluster:zedi-dev-cluster"
              - "AURORA_DATABASE_NAME"     = "zedi"
              - "COGNITO_REGION"           = "ap-northeast-1"
              - "COGNITO_USER_POOL_ID"     = "ap-northeast-1_FWvEaJ80a"
              - "CORS_ORIGIN"              = "*"
              - "DB_CREDENTIALS_SECRET"    = "arn:aws:secretsmanager:ap-northeast-1:590183877893:secret:zedi-dev-db-credentials-QbCDfb"
              - "ENVIRONMENT"              = "dev"
              - "LEMONSQUEEZY_SECRET_ARN"  = "arn:aws:secretsmanager:ap-northeast-1:590183877893:secret:zedi-dev-lemonsqueezy-LKeTVU"
              - "MEDIA_BUCKET"             = "zedi-dev-media-590183877893"
              - "NODE_OPTIONS"             = "--enable-source-maps"
              - "RATE_LIMIT_TABLE"         = "zedi-dev-ai-rate-limit"
              - "THUMBNAIL_BUCKET"         = "zedi-dev-thumbnails-590183877893"
              - "THUMBNAIL_CLOUDFRONT_URL" = "https://d1cxtfi0wdvqe3.cloudfront.net"
              - "THUMBNAIL_SECRETS_ARN"    = "arn:aws:secretsmanager:ap-northeast-1:590183877893:secret:zedi-dev-thumbnail-keys-1cveVR"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.api.null_resource.lambda_build must be replaced
-/+ resource "null_resource" "lambda_build" {
      ~ id       = "1051754498836761893" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "package_json" = "76bda656e601c0ba3297e506231275c5" -> "85c20903845d1ceef35d44013b79b105"
          ~ "src_hash"     = "5ae192e2c39507e51ef6e6a1a72cc0d2f62e12268f4b4e08a4bb594c6f1ee2a4" -> "2048d8cd8ae3ef7ce1e7cd5429c41296eca8ba8be06f73842e1d7e5da9565075"
        }
    }

  # module.cognito_github_proxy[0].aws_apigatewayv2_api.main will be created
  + resource "aws_apigatewayv2_api" "main" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + ip_address_type              = (known after apply)
      + name                         = "zedi-dev-cognito-github-proxy"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags                         = {
          + "Environment" = "dev"
          + "Project"     = "zedi"
        }
      + tags_all                     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "zedi"
        }
    }

  # module.cognito_github_proxy[0].aws_apigatewayv2_integration.lambda will be created
  + resource "aws_apigatewayv2_integration" "lambda" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.cognito_github_proxy[0].aws_apigatewayv2_route.proxy will be created
  + resource "aws_apigatewayv2_route" "proxy" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "ANY /{proxy+}"
      + target             = (known after apply)
    }

  # module.cognito_github_proxy[0].aws_apigatewayv2_route.root will be created
  + resource "aws_apigatewayv2_route" "root" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "ANY /"
      + target             = (known after apply)
    }

  # module.cognito_github_proxy[0].aws_apigatewayv2_stage.default will be created
  + resource "aws_apigatewayv2_stage" "default" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags          = {
          + "Environment" = "dev"
          + "Project"     = "zedi"
        }
      + tags_all      = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "zedi"
        }
    }

  # module.cognito_github_proxy[0].aws_iam_role.lambda will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "zedi-dev-cognito-github-proxy-lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "Project"     = "zedi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "zedi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cognito_github_proxy[0].aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "zedi-dev-cognito-github-proxy-lambda"
    }

  # module.cognito_github_proxy[0].aws_lambda_function.main will be created
  + resource "aws_lambda_function" "main" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "modules/cognito-github-proxy/lambda.zip"
      + function_name                  = "zedi-dev-cognito-github-proxy"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs22.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "AskMTwbRjG5QDl9zg6HsdHcJjDjDyvrkzZUg5iCeiOo="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "Project"     = "zedi"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "zedi"
        }
      + timeout                        = 15
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "GITHUB_CLIENT_ID"     = "Ov23liz1wBIxySSlVUJU"
              + "GITHUB_CLIENT_SECRET" = (sensitive value)
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.cognito_github_proxy[0].aws_lambda_permission.apigw will be created
  + resource "aws_lambda_permission" "apigw" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "zedi-dev-cognito-github-proxy"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.security.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.security.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.security.aws_cognito_identity_provider.github[0] will be updated in-place
  ~ resource "aws_cognito_identity_provider" "github" {
        id                = "ap-northeast-1_FWvEaJ80a:GitHub"
      ~ provider_details  = {
          - "attributes_request_method"     = "GET"
          - "attributes_url"                = "https://5zsq7g01c9.execute-api.ap-northeast-1.amazonaws.com/user"
          - "attributes_url_add_attributes" = "false"
          - "authorize_scopes"              = "openid user:email read:user"
          - "authorize_url"                 = "https://github.com/login/oauth/authorize"
          - "client_id"                     = "Ov23liz1wBIxySSlVUJU"
          - "client_secret"                 = (sensitive value)
          - "oidc_issuer"                   = "https://5zsq7g01c9.execute-api.ap-northeast-1.amazonaws.com"
          - "token_url"                     = "https://5zsq7g01c9.execute-api.ap-northeast-1.amazonaws.com/token"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.security.aws_cognito_user_pool_domain.main must be replaced
-/+ resource "aws_cognito_user_pool_domain" "main" {
      ~ aws_account_id                  = "590183877893" -> (known after apply)
      ~ cloudfront_distribution         = "d3vhah7crmmd43.cloudfront.net" -> (known after apply)
      ~ cloudfront_distribution_arn     = "d3vhah7crmmd43.cloudfront.net" -> (known after apply)
      ~ cloudfront_distribution_zone_id = "Z2FDTNDATAQYW2" -> (known after apply)
      ~ domain                          = "zedi-dev-590183877893" -> (known after apply) # forces replacement
      ~ id                              = "zedi-dev-590183877893" -> (known after apply)
      ~ managed_login_version           = 1 -> (known after apply)
      ~ s3_bucket                       = "aws-cognito-prod-nrt-assets" -> (known after apply)
      ~ version                         = "20260222045850" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.security.aws_iam_role_policy.ecs_execution_secrets will be updated in-place
  ~ resource "aws_iam_role_policy" "ecs_execution_secrets" {
        id          = "zedi-dev-ecs-execution-role:zedi-dev-ecs-execution-secrets"
        name        = "zedi-dev-ecs-execution-secrets"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "secretsmanager:GetSecretValue",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ap-northeast-1:590183877893:secret:zedi-dev-*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.security.aws_iam_role_policy.ecs_task_logs will be updated in-place
  ~ resource "aws_iam_role_policy" "ecs_task_logs" {
        id          = "zedi-dev-ecs-task-role:zedi-dev-ecs-task-logs"
        name        = "zedi-dev-ecs-task-logs"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ap-northeast-1:590183877893:log-group:/ecs/zedi-dev*:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.security.aws_iam_role_policy.ecs_task_ssm will be updated in-place
  ~ resource "aws_iam_role_policy" "ecs_task_ssm" {
        id          = "zedi-dev-ecs-task-role:zedi-dev-ecs-task-ssm"
        name        = "zedi-dev-ecs-task-ssm"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssm:GetParameter",
                          - "ssm:GetParameters",
                          - "ssm:GetParametersByPath",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ap-northeast-1:590183877893:parameter/zedi/dev/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription.aws_secretsmanager_secret.lemonsqueezy will be destroyed
  # (because aws_secretsmanager_secret.lemonsqueezy is not in configuration)
  - resource "aws_secretsmanager_secret" "lemonsqueezy" {
      - arn                            = "arn:aws:secretsmanager:ap-northeast-1:590183877893:secret:zedi-dev-lemonsqueezy-LKeTVU" -> null
      - description                    = "LemonSqueezy API key and webhook secret" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ap-northeast-1:590183877893:secret:zedi-dev-lemonsqueezy-LKeTVU" -> null
      - name                           = "zedi-dev-lemonsqueezy" -> null
      - recovery_window_in_days        = 0 -> null
      - tags                           = {
          - "Environment" = "dev"
          - "Project"     = "zedi"
        } -> null
      - tags_all                       = {
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Project"     = "zedi"
        } -> null
        # (3 unchanged attributes hidden)
    }

  # module.subscription.aws_secretsmanager_secret.polar will be created
  + resource "aws_secretsmanager_secret" "polar" {
      + arn                            = (known after apply)
      + description                    = "Polar access token and webhook secret"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "zedi-dev-polar"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "Environment" = "dev"
          + "Project"     = "zedi"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "zedi"
        }

      + replica (known after apply)
    }

  # module.subscription.aws_secretsmanager_secret_version.lemonsqueezy will be destroyed
  # (because aws_secretsmanager_secret_version.lemonsqueezy is not in configuration)
  - resource "aws_secretsmanager_secret_version" "lemonsqueezy" {
      - arn              = "arn:aws:secretsmanager:ap-northeast-1:590183877893:secret:zedi-dev-lemonsqueezy-LKeTVU" -> null
      - id               = "arn:aws:secretsmanager:ap-northeast-1:590183877893:secret:zedi-dev-lemonsqueezy-LKeTVU|terraform-20260214145440724000000006" -> null
      - secret_id        = "arn:aws:secretsmanager:ap-northeast-1:590183877893:secret:zedi-dev-lemonsqueezy-LKeTVU" -> null
      - secret_string    = (sensitive value) -> null
      - secret_string_wo = (write-only attribute) -> null
      - version_id       = "terraform-20260214145440724000000006" -> null
      - version_stages   = [
          - "AWSCURRENT",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # module.subscription.aws_secretsmanager_secret_version.polar will be created
  + resource "aws_secretsmanager_secret_version" "polar" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

Plan: 15 to add, 7 to change, 6 to destroy.

Changes to Outputs:
  ~ cognito_hosted_ui_url                     = "https://zedi-dev-590183877893.auth.ap-northeast-1.amazoncognito.com" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>